%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Аэродинамические коэффициенты %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Коэффициент подемной силы ЛА 
A.CL0 = 0.23; % Значение коэффициента подъемной силы ЛА при нулевом 
% угле атаки, отсутствии отклонения руля высоты и отсутствии вращения

A.CLa = 5.61; % Приращение засчет изменения угла атаки 
A.CLq = 7.95; % Приращение засчет вращения по тангажу
A.CLde = 0.13; % Приращенмия засчет отклонения руля высоты

% Коэффициент силы лобового сопротивления
A.CD0 = 0.043;
A.CDa = 0.03;
A.CDq = 0;
A.CDde = 0.0135;

% Коэффициент боковой силы
A.CN0 = 0;
A.CNb = -0.83;
A.CNp = 0;
A.CNr = 0;
A.CNda = 0.075;
A.CNdr = 0.19;

% Коэффициент момента тангажа
A.Cm0 = 0.0135;
A.Cma = -2.74;
A.Cmde = -0.99;
A.Cmq = -38.21;

% Коэффициент момента крена
A.Cl0 = 0;
A.Clb = -0.13;
A.Clp = -0.51;
A.Clr = 0.25;
A.Clda = 0.17;
A.Cldr = 0.0024;

% Коэффициент момента рыскания
A.Cn0 = 0;
A.Cnb = 0.073;
A.Cnp = -0.069;
A.Cnr = -0.095;
A.Cnda = -0.011;
A.Cndr = -0.069;

% сохранение в mat файл
save('Aero.mat', "A", '-mat');
